{
  "project": "takt",
  "branchName": "takt/v3-refinements",
  "description": "takt v3 Refinements - Model defaults, native worktree, git discipline, retro retention, BDD mindset, docs cleanup",
  "userStories": [
    {
      "id": "US-001",
      "title": "Explicit Sonnet 4.6 for all worker and verifier spawns",
      "description": "As a takt user, I want workers and verifiers to always use Sonnet 4.6 so that execution is fast, predictable, and free from Opus drift.",
      "type": "logic",
      "acceptanceCriteria": [
        "solo.md Task spawn for workers includes model: \"sonnet\" explicitly",
        "team-lead.md Task spawn for workers and verifiers includes model: \"sonnet\" explicitly",
        "The example story in commands/takt.md no longer includes a per-story model field"
      ],
      "priority": 1,
      "size": "small",
      "passes": true,
      "verify": "inline",
      "startTime": "2026-02-21 09:53",
      "endTime": "2026-02-21 09:57",
      "dependsOn": []
    },
    {
      "id": "US-002",
      "title": "Native worktree isolation in team mode",
      "description": "As a takt user, I want team mode to use Claude Code's native isolation: worktree so that worktree management is handled by the platform instead of custom bash commands.",
      "type": "logic",
      "acceptanceCriteria": [
        "team-lead.md spawns worker agents with isolation: \"worktree\" instead of manual git worktree add/remove commands",
        "Manual worktree cleanup commands (rm -rf .worktrees/, git worktree remove) are removed from team-lead.md",
        "CLAUDE.md and README.md references to .worktrees/ are updated to reflect native worktree isolation"
      ],
      "priority": 2,
      "size": "medium",
      "passes": true,
      "verify": "inline",
      "startTime": "2026-02-21 09:58",
      "endTime": "2026-02-21 10:00",
      "dependsOn": [
        "US-001"
      ]
    },
    {
      "id": "US-003",
      "title": "Git commit discipline for workers",
      "description": "As a takt user, I want workers to follow proper git discipline so that takt artifacts and unrelated files don't leak into feature commits.",
      "type": "logic",
      "acceptanceCriteria": [
        "worker.md commit section instructs workers to run git status before staging",
        "worker.md instructs workers to selectively git add only story-relevant files, explicitly excluding .takt/, stories.json, and other takt artifacts",
        "The git add -A pattern is removed from worker.md"
      ],
      "priority": 3,
      "size": "small",
      "passes": true,
      "verify": "inline",
      "startTime": "2026-02-21 09:53",
      "endTime": "2026-02-21 09:57",
      "dependsOn": []
    },
    {
      "id": "US-004",
      "title": "Retro retention policy and CHANGELOG",
      "description": "As a takt user, I want retro files to stay lean and improvements to be tracked in a changelog so that I have a clean operational view and a permanent record of how takt evolves.",
      "type": "logic",
      "acceptanceCriteria": [
        "lib/retro.md instructs the retro agent to keep only the alerts table + the most recent 1 entry, deleting older entries",
        "lib/retro.md instructs the retro agent to add a one-liner to CHANGELOG.md when an improvement is confirmed addressed",
        "A CHANGELOG.md file exists at the project root with dated entries for all changes in this update",
        ".takt/retro.md action items are marked done and alert statuses are updated to mitigated"
      ],
      "priority": 4,
      "size": "medium",
      "passes": true,
      "verify": "inline",
      "startTime": "2026-02-21 09:53",
      "endTime": "2026-02-21 09:59",
      "dependsOn": []
    },
    {
      "id": "US-005",
      "title": "BDD mindset for requirements and docs cleanup",
      "description": "As a takt user, I want requirements written as behavioral outcomes and stale documentation removed so that the PRD-to-scenario pipeline flows naturally and the docs folder reflects current state.",
      "type": "logic",
      "acceptanceCriteria": [
        "commands/takt-prd.md acceptance criteria guidance emphasizes behavioral outcomes over implementation checklists",
        "commands/takt.md scenario generation guidance reinforces BDD alignment from criteria to scenarios",
        "Unchecked items from TODO.md and IMPROVEMENTS.md are merged into future-improvements.md where not already present",
        "Stale docs deleted: CLAUDE_CODE_MIGRATION.md, dualoop-review.md, TODO.md, IMPROVEMENTS.md, dua-v2-planning.md"
      ],
      "priority": 5,
      "size": "medium",
      "passes": true,
      "verify": "deep",
      "startTime": "2026-02-21 09:58",
      "endTime": "2026-02-21 10:04",
      "dependsOn": [
        "US-001"
      ]
    }
  ],
  "waves": []
}
