{
  "project": "takt",
  "branchName": "takt/code-review",
  "description": "Code Review Agent — unbiased code quality gate between scenario verification and completion",
  "userStories": [
    {
      "id": "US-001",
      "title": "Create the code review agent prompt",
      "description": "As a takt orchestrator, I want a reviewer agent prompt so that I can spawn a read-only agent to review the final codebase after verification passes.",
      "type": "logic",
      "acceptanceCriteria": [
        "When the reviewer agent is spawned with a diff and CLAUDE.md contents, it produces a review-comments.json file with structured comments (file, line, severity, comment)",
        "When a comment has severity must-fix, the orchestrator knows to trigger a fix loop; when severity is suggestion, no fix is attempted",
        "The reviewer agent never modifies source code — it only reads and writes its review output"
      ],
      "priority": 1,
      "size": "medium",
      "passes": true,
      "verify": "inline",
      "startTime": "2026-03-02 00:00",
      "endTime": "2026-03-02 00:05",
      "dependsOn": [],
      "knownIssues": []
    },
    {
      "id": "US-002",
      "title": "Wire review phase into solo.md orchestrator",
      "description": "As a takt user running solo mode, I want the orchestrator to run a code review after scenario verification so that quality issues are caught before completion.",
      "type": "logic",
      "acceptanceCriteria": [
        "When scenario verification passes, the orchestrator spawns a reviewer agent before proceeding to completion",
        "When the reviewer finds must-fix issues, the orchestrator spawns fresh fix workers for each issue (max 2 review-fix cycles), then re-runs the reviewer",
        "When must-fix issues remain after 2 cycles, the orchestrator includes them in its completion output as known issues and proceeds (does not block completion)"
      ],
      "priority": 2,
      "size": "medium",
      "passes": true,
      "verify": "inline",
      "startTime": "2026-03-02 00:05",
      "endTime": "2026-03-02 00:12",
      "dependsOn": ["US-001"],
      "knownIssues": []
    },
    {
      "id": "US-003",
      "title": "Wire review phase into team-lead.md and update install.sh + retro cleanup",
      "description": "As a takt user running team mode, I want the same code review phase available in team executions, and I want the reviewer prompt installed and its artifacts cleaned up by retro.",
      "type": "logic",
      "acceptanceCriteria": [
        "When scenario verification passes in team mode, the team lead spawns a reviewer agent with the same prompt and flow as solo mode",
        "install.sh copies reviewer.md to ~/.claude/lib/takt/ and the session agent reads it alongside worker.md and verifier.md",
        "The retro agent deletes review-comments.json during its cleanup step alongside other run artifacts"
      ],
      "priority": 3,
      "size": "medium",
      "passes": true,
      "verify": "deep",
      "startTime": "2026-03-02 00:12",
      "endTime": "2026-03-02 00:20",
      "dependsOn": ["US-002"],
      "knownIssues": []
    }
  ],
  "waves": []
}
